STM32World/stlink/src/stlink-lib/common_legacy.c
/* == nightwalker-87: TODO: CONTENT AND USE OF THIS SOURCE FILE IS TO BE VERIFIED (07.06.2023) == */
/* TODO: This file should be split up into new or existing modules. */

/*
 * File: common_legacy.c
 *
 *
 */

#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>
#include <fcntl.h>
// #include <sys/stat.h>  // TODO: Check use
// #include <sys/types.h> // TODO: Check use

#include <stlink.h>
#include <stlink_backend.h>
#include <stm32_register.h>

#include "calculate.h"
#include "chipid.h"
#include "common_flash.h"
#include "helper.h"
#include "logging.h"
#include "map_file.h"
#include "md5.h"
#include "read_write.h"
#include "usb.h"

#ifndef O_BINARY
#define O_BINARY 0
#endif

#ifdef _MSC_VER
#define __attribute__(x)
#endif

/* === Declaration of private structs and functions === */

struct stlink_fread_worker_arg {
  int32_t fd;
};

struct stlink_fread_ihex_worker_arg {
  FILE *file;
  uint32_t addr;
  uint32_t lba;
  uint8_t buf[16];
  uint8_t buf_pos;
};

typedef bool (*save_block_fn)(void *arg, uint8_t *block, ssize_t len);

static void stop_wdg_in_debug(stlink_t *);
int32_t stlink_jtag_reset(stlink_t *, int32_t);
int32_t stlink_soft_reset(stlink_t *, int32_t);
void _parse_version(stlink_t *, stlink_version_t *);
static uint8_t stlink_parse_hex(const char *);
static int32_t stlink_read(stlink_t *, stm32_addr_t, uint32_t, save_block_fn, void *);
static bool stlink_fread_ihex_init(struct stlink_fread_ihex_worker_arg *, int32_t, stm32_addr_t);
// static bool stlink_fread_ihex_newsegment(struct stlink_fread_ihex_worker_arg *the_arg);
// static bool stlink_fread_ihex_writeline(struct stlink_fread_ihex_worker_arg *the_arg);
static bool stlink_fread_ihex_worker(void *, uint8_t *, ssize_t);
static bool stlink_fread_ihex_finalize(struct stlink_fread_ihex_worker_arg *);

static bool stlink_fread_worker(void *, uint8_t *, ssize_t);
static inline bool stlink_is_cm33_core(const stlink_t *sl);
static inline bool stlink_h5_dbgmcu_probe_looks_like_h5(const cortex_m3_cpuid_t *cpu_id,
                                                        uint32_t dbgmcu_idcode);
static int32_t stlink_h5_try_connect_under_reset(stlink_t *sl);
static inline void stlink_h5_enable_ap1_mode(stlink_t *sl);
static inline void stlink_h5_mark_attached(stlink_t *sl);
static inline void stlink_h5_reset_state(stlink_t *sl, uint8_t target_ap);
static int32_t stlink_h5_wait_core_regs_ready(stlink_t *sl, uint32_t *last_dhcsr);


/* === Definition of private structs and functions from stlink.h === */

static inline bool stlink_is_cm33_core(const stlink_t *sl) {
  return sl->core_id == STM32_CORE_ID_M7F_M33_SWD ||
         sl->core_id == STM32_CORE_ID_M7F_M33_JTAG;
}

static inline bool stlink_h5_dbgmcu_probe_looks_like_h5(const cortex_m3_cpuid_t *cpu_id,
                                                        uint32_t dbgmcu_idcode) {
  return cpu_id->part == STM32_REG_CMx_CPUID_PARTNO_CM33 &&
         dbgmcu_idcode == 0;
}

static inline void stlink_h5_enable_ap1_mode(stlink_t *sl) {
  sl->h5_ap1_mode = true;
  sl->target_ap = 1;
}

static inline void stlink_h5_mark_attached(stlink_t *sl) {
  stlink_h5_enable_ap1_mode(sl);
  sl->h5_native_debug_regs = true;
  sl->h5_native_core_regs = true;
}

static inline void stlink_h5_reset_state(stlink_t *sl, uint8_t target_ap) {
  sl->target_ap = target_ap;
  stlink_invalidate_ap_session(sl);
  sl->h5_ap1_mode = false;
  sl->h5_native_debug_regs = false;
  sl->h5_native_core_regs = false;
}

static int32_t stlink_h5_wait_core_regs_ready(stlink_t *sl, uint32_t *last_dhcsr) {
  uint32_t dhcsr = 0;
  uint32_t timeout = time_ms() + 100;

  while(time_ms() < timeout) {
    if(stlink_read_debug32(sl, STM32_REG_DHCSR, &dhcsr) == -1) {
      return (-1);
    }

    if((dhcsr & (STM32_REG_DHCSR_S_HALT | STM32_REG_DHCSR_S_REGRDY)) ==
       (STM32_REG_DHCSR_S_HALT | STM32_REG_DHCSR_S_REGRDY)) {
      if(last_dhcsr != NULL) {
        *last_dhcsr = dhcsr;
      }
      return (0);
    }

    usleep(1000);
  }

  if(last_dhcsr != NULL) {
    *last_dhcsr = dhcsr;
  }

  return (-1);
}

static int32_t stlink_h5_try_connect_under_reset(stlink_t *sl) {
  cortex_m3_cpuid_t cpu_id;
  uint32_t dbgmcu_idcode = 0;
  uint32_t dhcsr = 0;
  uint32_t timeout;
  uint8_t original_target_ap = sl->target_ap;
  const uint32_t halt_req = STM32_REG_DHCSR_DBGKEY |
                            STM32_REG_DHCSR_C_HALT |
                            STM32_REG_DHCSR_C_DEBUGEN;

  if(stlink_enter_swd_mode(sl) == 0 &&
     stlink_core_id(sl) == 0 &&
     stlink_is_cm33_core(sl) &&
     stlink_cpu_id(sl, &cpu_id) == 0 &&
     stlink_read_debug32(sl, 0xE0044000, &dbgmcu_idcode) == 0 &&
     stlink_h5_dbgmcu_probe_looks_like_h5(&cpu_id, dbgmcu_idcode)) {
    /*
     * H5 attach runs under reset through AP1. Keep NRST asserted while
     * entering SWD, initialize AP1, arm halt/debug, then release reset and
     * poll DHCSR until the core halts.
     */
    stlink_h5_enable_ap1_mode(sl);

    stlink_invalidate_ap_session(sl);
    sl->h5_native_debug_regs = true;
    sl->h5_native_core_regs = false;

    if(stlink_write_debug32(sl, STM32_REG_DHCSR, halt_req) != 0) {
      sl->h5_native_debug_regs = false;
      stlink_h5_reset_state(sl, original_target_ap);
      return (-1);
    }

    if(stlink_read_debug32(sl, STM32_REG_DHCSR, &dhcsr)) {
      sl->h5_native_debug_regs = false;
      stlink_h5_reset_state(sl, original_target_ap);
      return (-1);
    }

    if(stlink_write_debug32(sl, STM32_REG_CM3_DEMCR,
                            STM32_REG_CM3_DEMCR_VC_CORERESET)) {
      sl->h5_native_debug_regs = false;
      stlink_h5_reset_state(sl, original_target_ap);
      return (-1);
    }

    if(stlink_read_debug32(sl, STM32_REG_DHCSR, &dhcsr)) {
      sl->h5_native_debug_regs = false;
      stlink_h5_reset_state(sl, original_target_ap);
      return (-1);
    }

    // minimum reset pulse duration of 20 us (RM0008, 8.1.2 Power reset)
    usleep(20);

    if(stlink_jtag_reset(sl, STLINK_DEBUG_APIV2_DRIVE_NRST_HIGH)) {
      sl->h5_native_debug_regs = false;
      stlink_h5_reset_state(sl, original_target_ap);
      return (-1);
    }

