STM32World/stlink/src/stlink-lib/common_legacy.c
/* === Definition of functions from stlink.h === */

int32_t stlink_enter_swd_mode(stlink_t *sl) {
  DLOG("*** stlink_enter_swd_mode ***\n");
  return (sl->backend->enter_swd_mode(sl));
}

int32_t stlink_exit_debug_mode(stlink_t *sl) {
  DLOG("*** stlink_exit_debug_mode ***\n");

  if(stlink_current_mode(sl) != STLINK_DEV_DEBUG_MODE) {
      // STLINK-V3 locks up completely when calling DEBUG_EXIT in MASS mode
      return 0;
  }

  if(sl->flash_type != STM32_FLASH_TYPE_UNKNOWN &&
      sl->core_stat != TARGET_RESET) {
    // stop debugging if the target has been identified
    stlink_write_debug32(sl, STM32_REG_DHCSR, STM32_REG_DHCSR_DBGKEY);
  }

  return (sl->backend->exit_debug_mode(sl));
}

int32_t stlink_exit_dfu_mode(stlink_t *sl) {
  DLOG("*** stlink_exit_dfu_mode ***\n");
  return (sl->backend->exit_dfu_mode(sl));
}

void stlink_close(stlink_t *sl) {
  DLOG("*** stlink_close ***\n");

  if(!sl) {
    return;
  }

  sl->backend->close(sl);
  free(sl);
}

int32_t stlink_core_id(stlink_t *sl) {
  int32_t ret;

  DLOG("*** stlink_core_id ***\n");
  ret = sl->backend->core_id(sl);

  if(ret == -1) {
    ELOG("Failed to read core_id\n");
    return (ret);
  }

  if(sl->verbose > 2) {
    stlink_print_data(sl);
  }

  if(stlink_is_cm33_core(sl)) {
    stlink_h5_enable_ap1_mode(sl);
    if(!sl->h5_native_debug_regs) {
      stlink_invalidate_ap_session(sl);
    }
  }

  DLOG("core_id = 0x%08x\n", sl->core_id);
  return (ret);
}

int32_t stlink_reset(stlink_t *sl, enum reset_type type) {
  uint32_t dhcsr;
  uint32_t timeout;

  DLOG("*** stlink_reset ***\n");

  sl->core_stat = TARGET_RESET;

  if(type == RESET_AUTO) {
    // clear S_RESET_ST in DHCSR register for reset state detection
    stlink_read_debug32(sl, STM32_REG_DHCSR, &dhcsr);
  }

  if(type == RESET_HARD || type == RESET_AUTO) {
    // hardware target reset
    if(sl->version.stlink_v > 1) {
      stlink_jtag_reset(sl, STLINK_DEBUG_APIV2_DRIVE_NRST_LOW);
      // minimum reset pulse duration of 20 us (RM0008, 8.1.2 Power reset)
      usleep(100);
      stlink_jtag_reset(sl, STLINK_DEBUG_APIV2_DRIVE_NRST_HIGH);
    }
    sl->backend->reset(sl);
    usleep(10000);
  }

  if(type == RESET_AUTO) {
    /* Check if the S_RESET_ST bit is set in DHCSR
     * This means that a reset has occurred
     * DDI0337E, p. 10-4, Debug Halting Control and Status Register
     */

    dhcsr = 0;
    int32_t res = stlink_read_debug32(sl, STM32_REG_DHCSR, &dhcsr);
    if((dhcsr & STM32_REG_DHCSR_S_RESET_ST) == 0 && !res) {
      // reset not done yet --> try reset through AIRCR so that NRST does not need to be connected
      ILOG("NRST is not connected --> using software reset via AIRCR\n");
      DLOG("NRST not connected --> Reset through SYSRESETREQ\n");
      return stlink_soft_reset(sl, 0);
    }

    // waiting for reset the S_RESET_ST bit within 500ms
    timeout = time_ms() + 500;
    while (time_ms() < timeout) {
      dhcsr = STM32_REG_DHCSR_S_RESET_ST;
      stlink_read_debug32(sl, STM32_REG_DHCSR, &dhcsr);
      if((dhcsr & STM32_REG_DHCSR_S_RESET_ST) == 0) {
        return (0);
      }
    }

    return (-1);
  }

  if(type == RESET_SOFT || type == RESET_SOFT_AND_HALT) {
    return stlink_soft_reset(sl, (type == RESET_SOFT_AND_HALT));
  }

  return (0);
}

int32_t stlink_run(stlink_t *sl, enum run_type type) {
  struct stlink_reg rr;
  uint32_t dhcsr = 0;
  DLOG("*** stlink_run ***\n");

  if(type == RUN_FLASH_LOADER) {
    /*
     * Flash loaders are always Thumb code. Set a known-good xPSR instead of
     * depending on whatever the target left behind after reset or a fault.
     */
    if(stlink_write_reg(sl, 0x01000000, 16) == -1) {
      return (-1);
    }

    return (sl->backend->run(sl, type));
  }

  if(stlink_h5_uses_ap(sl)) {
    if(stlink_read_debug32(sl, STM32_REG_DHCSR, &dhcsr) == -1) {
      return (-1);
    }

    if((dhcsr & (STM32_REG_DHCSR_S_HALT | STM32_REG_DHCSR_S_REGRDY)) !=
       (STM32_REG_DHCSR_S_HALT | STM32_REG_DHCSR_S_REGRDY)) {
      DLOG("H5 RUN_NORMAL forcing halt before core register access (DHCSR=0x%08x)\n",
           dhcsr);
      if(stlink_force_debug(sl) == -1) {
        return (-1);
      }
      stlink_h5_mark_attached(sl);
      if(stlink_h5_wait_core_regs_ready(sl, &dhcsr) == -1) {
        WLOG("H5 core registers not ready after halt (DHCSR=0x%08x)\n", dhcsr);
        return (-1);
      }
    }
  }

  /* Make sure we are in Thumb mode
   * Cortex-M chips don't support ARM mode instructions
   * xPSR may be incorrect if the vector table has invalid data */
  if(stlink_read_reg(sl, 16, &rr) == -1) {
    return (-1);
  }

  if((rr.xpsr & (1 << 24)) == 0) {
    ILOG("Go to Thumb mode\n");
    if(stlink_write_reg(sl, rr.xpsr | (1 << 24), 16) == -1) {
      return (-1);
    }
  }

  return (sl->backend->run(sl, type));
}

// this function is called by stlink_status()
// do not call this procedure directly, always use stlink_status()
void stlink_core_stat(stlink_t *sl) {
  switch (sl->core_stat) {
  case TARGET_RUNNING:
    DLOG("  core status: running\n");
    return;
  case TARGET_HALTED:
    DLOG("  core status: halted\n");
    return;
  case TARGET_RESET:
    DLOG("  core status: reset\n");
    return;
  case TARGET_DEBUG_RUNNING:
    DLOG("  core status: debug running\n");
    return;
  default:
    DLOG("  core status: unknown\n");
  }
}

int32_t stlink_status(stlink_t *sl) {
  int32_t ret;

  DLOG("*** stlink_status ***\n");
  ret = sl->backend->status(sl);
  stlink_core_stat(sl);
  return (ret);
}

int32_t stlink_version(stlink_t *sl) {
  DLOG("*** looking up stlink version ***\n");

  if(sl->backend->version(sl)) {
    return (-1);
  }

  _parse_version(sl, &sl->version);

  DLOG("st vid         = 0x%04x (expect 0x%04x)\n", sl->version.st_vid,
       STLINK_USB_VID_ST);
  DLOG("stlink pid     = 0x%04x\n", sl->version.stlink_pid);
  DLOG("stlink version = 0x%x\n", sl->version.stlink_v);
  DLOG("jtag version   = 0x%x\n", sl->version.jtag_v);
  DLOG("swim version   = 0x%x\n", sl->version.swim_v);

  if(sl->version.jtag_v == 0) {
    WLOG("    warning: stlink doesn't support JTAG/SWD interface\n");
  }

  return (0);
}

int32_t stlink_step(stlink_t *sl) {
  DLOG("*** stlink_step ***\n");
  return (sl->backend->step(sl));
}

int32_t stlink_current_mode(stlink_t *sl) {
  int32_t mode = sl->backend->current_mode(sl);

