STM32World/stlink/src/stlink-lib/common_legacy.c
  switch (mode) {
  case STLINK_DEV_DFU_MODE:
    DLOG("stlink current mode: dfu\n");
    return (mode);
  case STLINK_DEV_DEBUG_MODE:
    DLOG("stlink current mode: debug (jtag or swd)\n");
    return (mode);
  case STLINK_DEV_MASS_MODE:
    DLOG("stlink current mode: mass\n");
    return (mode);
  }

  DLOG("stlink mode: unknown!\n");
  return (STLINK_DEV_UNKNOWN_MODE);
}

// Force the core into the debug mode -> halted state.
int32_t stlink_force_debug(stlink_t *sl) {
  uint32_t dhcsr = 0;

  DLOG("*** stlink_force_debug_mode ***\n");

  int32_t res;
  if(stlink_h5_uses_ap(sl)) {
    res = stlink_write_debug32(sl, STM32_REG_DHCSR,
                               STM32_REG_DHCSR_DBGKEY |
                               STM32_REG_DHCSR_C_HALT |
                               STM32_REG_DHCSR_C_DEBUGEN);
  } else {
    res = sl->backend->force_debug(sl);
  }

  if(res) {
    return (res);
  }

  uint32_t timeout = time_ms() + 100;
  while(time_ms() < timeout) {
    if(stlink_read_debug32(sl, STM32_REG_DHCSR, &dhcsr) == -1) {
      return (-1);
    }

    if(dhcsr & STM32_REG_DHCSR_S_HALT) {
      sl->core_stat = TARGET_HALTED;
      stop_wdg_in_debug(sl);
      return (0);
    }

    usleep(1000);
  }

  ELOG("Failed to halt target after FORCEDEBUG (DHCSR=0x%08x)\n", dhcsr);
  return (-1);
}

int32_t stlink_target_voltage(stlink_t *sl) {
  int32_t voltage = -1;
  DLOG("*** reading target voltage\n");

  if(sl->backend->target_voltage != NULL) {
    voltage = sl->backend->target_voltage(sl);

    if(voltage != -1) {
      DLOG("target voltage = %imV\n", voltage);
    } else {
      DLOG("error reading target voltage\n");
    }
  } else {
    DLOG("reading voltage not supported by backend\n");
  }

  return (voltage);
}

int32_t stlink_set_swdclk(stlink_t *sl, int32_t freq_khz) {
  DLOG("*** set_swdclk ***\n");
  return (sl->backend->set_swdclk(sl, freq_khz));
}

int32_t stlink_parse_ihex(const char *path, uint8_t erased_pattern, uint8_t **mem,
                      uint32_t *size, uint32_t *begin) {
  int32_t res = 0;
  *begin = UINT32_MAX;
  uint8_t *data = NULL;
  uint32_t end = 0;
  bool eof_found = false;

  for(int32_t scan = 0; (res == 0) && (scan < 2); ++scan) {
    // parse file two times - first to find memory range, second - to fill it
    if(scan == 1) {
      if(!eof_found) {
        ELOG("No EoF recond\n");
        res = -1;
        break;
      }

      if(*begin >= end) {
        ELOG("No data found in file\n");
        res = -1;
        break;
      }

      *size = (end - *begin) + 1;
      data = calloc(1, *size); // use calloc to get NULL if out of memory

      if(!data) {
        ELOG("Cannot allocate %u bytes\n", (*size));
        res = -1;
        break;
      }

      memset(data, erased_pattern, *size);
    }

    FILE *file = fopen(path, "r");

    if(!file) {
      ELOG("Cannot open file\n");
      res = -1;
      break;
    }

    uint32_t lba = 0;
    char line[1 + 5 * 2 + 255 * 2 + 2];

    while (fgets(line, sizeof(line), file)) {
      if(line[0] == '\n' || line[0] == '\r') {
        continue;
      } // skip empty lines

      if(line[0] != ':') { // no marker - wrong file format
        ELOG("Wrong file format - no marker\n");
        res = -1;
        break;
      }

      uint64_t l = strlen(line);

      while (l > 0 && (line[l - 1] == '\n' || line[l - 1] == '\r')) {
        --l;
      } // trim EoL

      if((l < 11) ||
          (l ==
           (sizeof(line) - 1))) { // line too short or long - wrong file format
        ELOG("Wrong file format - wrong line length\n");
        res = -1;
        break;
      }

      uint8_t chksum = 0; // check sum

      for(uint32_t i = 1; i < l; i += 2) {
        chksum += stlink_parse_hex(line + i);
      }

      if(chksum != 0) {
        ELOG("Wrong file format - checksum mismatch\n");
        res = -1;
        break;
      }

      uint8_t reclen = stlink_parse_hex(line + 1);

      if(((uint32_t) reclen + 5) * 2 + 1 != l) {
        ELOG("Wrong file format - record length mismatch\n");
        res = -1;
        break;
      }

      uint16_t offset = ((uint16_t) stlink_parse_hex(line + 3) << 8) |
                        ((uint16_t) stlink_parse_hex(line + 5));
      uint8_t rectype = stlink_parse_hex(line + 7);

      switch (rectype) {
      case 0: /* Data */
        if(scan == 0) {
          uint32_t b = lba + offset;
          uint32_t e = b + reclen - 1;

          if(b < *begin) {
            *begin = b;
          }

          if(e > end) {
            end = e;
          }
        } else {
          for(uint8_t i = 0; i < reclen; ++i) {
            uint8_t b = stlink_parse_hex(line + 9 + i * 2);
            uint32_t addr = lba + offset + i;

            if(addr >= *begin && addr <= end) {
              data[addr - *begin] = b;
            }
          }
        }
        break;
      case 1: /* EoF */
        eof_found = true;
        break;
      case 2: /* Extended Segment Address, unexpected */
        res = -1;
        break;
      case 3: /* Start Segment Address, unexpected */
        res = -1;
        break;
      case 4: /* Extended Linear Address */
        if(reclen == 2) {
          lba = ((uint32_t) stlink_parse_hex(line + 9) << 24) |
                ((uint32_t) stlink_parse_hex(line + 11) << 16);
        } else {
          ELOG("Wrong file format - wrong LBA length\n");
          res = -1;
        }
        break;
      case 5: /* Start Linear Address - expected, but ignore */
        break;
      default:
        ELOG("Wrong file format - unexpected record type %d\n", rectype);
        res = -1;
      }

      if(res != 0) {
        break;
      }
    }

    fclose(file);
  }

  if(res == 0) {
    *mem = data;
  } else {
    free(data);
  }

  return (res);
}

uint8_t stlink_get_erased_pattern(stlink_t *sl) {
  if(sl->flash_type == STM32_FLASH_TYPE_L0_L1) {
    return (0x00);
  } else {
    return (0xff);
  }
}

int32_t stlink_mwrite_sram(stlink_t *sl, uint8_t *data, uint32_t length, stm32_addr_t addr) {
  // write the file in sram at addr

