STM32World/stlink/src/stlink-lib/common_legacy.c
  int32_t error = -1;
  uint32_t off;
  uint32_t len;

  // check addr range is inside the sram
  if(addr < sl->sram_base) {
    fprintf(stderr, "addr too low\n");
    goto on_error;
  } else if((addr + length) < addr) {
    fprintf(stderr, "addr overruns\n");
    goto on_error;
  } else if((addr + length) > (sl->sram_base + sl->sram_size)) {
    fprintf(stderr, "addr too high\n");
    goto on_error;
  } else if(addr & 3) {
    fprintf(stderr, "unaligned addr\n");
    goto on_error;
  }

  len = length;

  if(len & 3) {
    len -= len & 3;
  }

  // do the copy by 1kB blocks
  for(off = 0; off < len; off += 1024) {
    uint32_t size = 1024;

    if((off + size) > len) {
      size = len - off;
    }

    memcpy(sl->q_buf, data + off, size);

    if(size & 3) {
      size += 2;
    } // round size if needed

    stlink_write_mem32(sl, addr + off, (uint16_t) size);
  }

  if(length > len) {
    memcpy(sl->q_buf, data + len, length - len);
    stlink_write_mem8(sl, addr + len, (uint16_t) (length - len));
  }

  error = 0; // success
  stlink_fwrite_finalize(sl, addr);

  on_error:
    return (error);
}

int32_t stlink_fwrite_sram(stlink_t *sl, const char *path, stm32_addr_t addr) {
  // write the file in sram at addr

  int32_t error = -1;
  uint32_t off;
  uint32_t len;
  mapped_file_t mf = MAPPED_FILE_INITIALIZER;

  if(map_file(&mf, path) == -1) {
    fprintf(stderr, "map_file() == -1\n");
    return (-1);
  }

  printf("file %s ", path);
  md5_calculate(&mf);
  stlink_checksum(&mf);

  // check if addr range is inside the SRAM
  if(addr < sl->sram_base) {
    fprintf(stderr, "addr too low\n");
    goto on_error;
  } else if((addr + mf.len) < addr) {
    fprintf(stderr, "addr overruns\n");
    goto on_error;
  } else if((addr + mf.len) > (sl->sram_base + sl->sram_size)) {
    fprintf(stderr, "addr too high\n");
    goto on_error;
  } else if(addr & 3) {
    fprintf(stderr, "unaligned addr\n");
    goto on_error;
  }

  len = mf.len;

  if(len & 3) {
    len -= len & 3;
  }

  // do the copy by 1kB blocks
  for(off = 0; off < len; off += 1024) {
    uint32_t size = 1024;

    if((off + size) > len) {
      size = len - off;
    }

    memcpy(sl->q_buf, mf.base + off, size);

    if(size & 3) {
      size += 2;
    } // round size if needed

    stlink_write_mem32(sl, addr + off, (uint16_t) size);
  }

  if(mf.len > len) {
    memcpy(sl->q_buf, mf.base + len, mf.len - len);
    stlink_write_mem8(sl, addr + len, (uint16_t) (mf.len - len));
  }

  // check the file has been written
  if(check_file(sl, &mf, addr) == -1) {
    fprintf(stderr, "check_file() == -1\n");
    goto on_error;
  }

  error = 0; // success
  stlink_fwrite_finalize(sl, addr);

  on_error:
    unmap_file(&mf);
    return (error);
}

/**
 * Cortex M tech ref manual, CPUID register description
 * @param sl stlink context
 * @param cpuid pointer to the result object
 */
int32_t stlink_cpu_id(stlink_t *sl, cortex_m3_cpuid_t *cpuid) {
  uint32_t raw;

  if(stlink_read_debug32(sl, STM32_REG_CM3_CPUID, &raw)) {
    cpuid->implementer_id = 0;
    cpuid->variant = 0;
    cpuid->part = 0;
    cpuid->revision = 0;
    return (-1);
  }

  cpuid->implementer_id = (raw >> 24) & 0x7f;
  cpuid->variant = (raw >> 20) & 0xf;
  cpuid->part = (raw >> 4) & 0xfff;
  cpuid->revision = raw & 0xf;
  return (0);
}

uint32_t stlink_calculate_pagesize(stlink_t *sl, uint32_t flashaddr) {

  if((sl->chip_id == STM32_CHIPID_F2) ||
      (sl->chip_id == STM32_CHIPID_F4) ||
      (sl->chip_id == STM32_CHIPID_F4_DE) ||
      (sl->chip_id == STM32_CHIPID_F4_LP) ||
      (sl->chip_id == STM32_CHIPID_F4_HD) ||
      (sl->chip_id == STM32_CHIPID_F411xx) ||
      (sl->chip_id == STM32_CHIPID_F446) ||
      (sl->chip_id == STM32_CHIPID_F4_DSI) ||
      (sl->chip_id == STM32_CHIPID_F72xxx) ||
      (sl->chip_id == STM32_CHIPID_F412)) {
    uint32_t sector = calculate_F4_sectornum(flashaddr);

    if(sector >= 12) {
      sector -= 12;
    }

    if(sector < 4) {
      sl->flash_pgsz = 0x4000;
    } else if(sector < 5) {
      sl->flash_pgsz = 0x10000;
    } else {
      sl->flash_pgsz = 0x20000;
    }
  } else if(sl->chip_id == STM32_CHIPID_F7 ||
             sl->chip_id == STM32_CHIPID_F76xxx) {
    uint32_t sector = calculate_F7_sectornum(flashaddr);

    if(sector < 4) {
      sl->flash_pgsz = 0x8000;
    } else if(sector < 5) {
      sl->flash_pgsz = 0x20000;
    } else {
      sl->flash_pgsz = 0x40000;
    }
  }

  return (sl->flash_pgsz);
}

void stlink_print_data(stlink_t *sl) {
  if(sl->q_len <= 0 || sl->verbose < UDEBUG) {
    return;
  }

  if(sl->verbose > 2) {
    DLOG("data_len = %d 0x%x\n", sl->q_len, sl->q_len);
  }

  for(int32_t i = 0; i < sl->q_len; i++) {
    if(i % 16 == 0) {
      /*
      if(sl->q_data_dir == Q_DATA_OUT) {
          fprintf(stdout, "\n<- 0x%08x ", sl->q_addr + i);
      } else {
          fprintf(stdout, "\n-> 0x%08x ", sl->q_addr + i);
      }
      */
    }
    // DLOG(" %02x", (uint32_t) sl->q_buf[i]);
    fprintf(stderr, " %02x", (uint32_t) sl->q_buf[i]);
  }
  // DLOG("\n\n");
  fprintf(stderr, "\n");
}

bool stlink_is_core_halted(stlink_t *sl) {
  stlink_status(sl);
  return (sl->core_stat == TARGET_HALTED);
}

int32_t write_buffer_to_sram(stlink_t *sl, flash_loader_t *fl, const uint8_t *buf, uint16_t size, uint16_t padded_size) {
  // write the buffer right after the loader, and pad the end with 0xFF if padded_size is larger than size
  int32_t ret = 0;
  uint16_t data_remaining = size;
  uint16_t off = 0;
  
  if (padded_size < size) {
    padded_size = size;
  }

  /* AP-routed SRAM staging uses 1 KiB WRITEMEM_32BIT chunks. */
  const uint16_t max_word_chunk = stlink_target_uses_ap(sl) ? 1024 : 512;
  uint16_t word_chunk = padded_size & ~0x3;
  uint16_t byte_chunk = padded_size & 0x3;

  while(word_chunk && !ret) {
    uint16_t chunk = word_chunk > max_word_chunk ? max_word_chunk : word_chunk;
    uint16_t data_cnt = chunk > data_remaining ? data_remaining : chunk;

    memcpy(sl->q_buf, buf + off, data_cnt);
    memset(sl->q_buf + data_cnt, 0xFF, chunk - data_cnt);
    ret = stlink_write_mem32(sl, fl->buf_addr + off, chunk);
    if(ret && stlink_target_uses_ap(sl)) {
      ELOG("AP%u SRAM stage failed at %#010x (offset %#x, chunk %#x)\n",
           sl->target_ap, fl->buf_addr + off, off, chunk);
    }

