STM32World/stlink/src/stlink-lib/common_legacy.c
    word_chunk -= chunk;
    off += chunk;
    data_remaining -= data_cnt;
  }

  if(byte_chunk && !ret) {
    uint16_t data_cnt = byte_chunk > data_remaining ? data_remaining : byte_chunk;
    memcpy(sl->q_buf, buf + off, data_cnt);
    memset(sl->q_buf + data_cnt, 0xFF, byte_chunk - data_cnt);
    ret = stlink_write_mem8(sl, fl->buf_addr + off, byte_chunk);
    if(ret && stlink_target_uses_ap(sl)) {
      ELOG("AP%u SRAM byte stage failed at %#010x (offset %#x, chunk %#x)\n",
           sl->target_ap, fl->buf_addr + off, off, byte_chunk);
    }
  }

  return (ret);
}

int32_t stlink_fread(stlink_t *sl, const char *path, bool is_ihex, stm32_addr_t addr, uint32_t size) {
  // read size bytes from addr to file
  ILOG("read from address %#010x size %u\n", addr, size);

  int32_t error;
  int32_t fd = open(path, O_RDWR | O_TRUNC | O_CREAT | O_BINARY, 00700);

  if(fd == -1) {
    fprintf(stderr, "open(%s) == -1\n", path);
    return (-1);
  }

  if(is_ihex) {
    struct stlink_fread_ihex_worker_arg arg;

    if(stlink_fread_ihex_init(&arg, fd, addr)) {
      error = stlink_read(sl, addr, size, &stlink_fread_ihex_worker, &arg);

      if(!stlink_fread_ihex_finalize(&arg)) {
        error = -1;
      }
    } else {
      error = -1;
    }
  } else {
    struct stlink_fread_worker_arg arg = {fd};
    error = stlink_read(sl, addr, size, &stlink_fread_worker, &arg);
  }

  close(fd);
  return (error);
}

// this function is called by stlink_load_device_params()
// do not call this procedure directly.
int32_t stlink_chip_id(stlink_t *sl, uint32_t *chip_id) {
  int32_t ret;
  cortex_m3_cpuid_t cpu_id;
  uint8_t original_target_ap = sl->target_ap;

  // Read the CPU ID to determine where to read the core id
  if(stlink_cpu_id(sl, &cpu_id) ||
      cpu_id.implementer_id != STM32_REG_CMx_CPUID_IMPL_ARM) {
    ELOG("Can not connect to target. Please use \'connect under reset\' and try again\n");
    return -1;
  }

  /*
   * the chip_id register in the reference manual have
   * DBGMCU_IDCODE / DBG_IDCODE name
   */

  if((sl->core_id == STM32_CORE_ID_M7F_M33_SWD || sl->core_id == STM32_CORE_ID_M7F_M33_JTAG) &&
      cpu_id.part == STM32_REG_CMx_CPUID_PARTNO_CM7) {
    // STM32H7 chipid in 0x5c001000 (RM0433 pg3189)
    ret = stlink_read_debug32(sl, 0x5c001000, chip_id);
  } else if(cpu_id.part == STM32_REG_CMx_CPUID_PARTNO_CM0 ||
             cpu_id.part == STM32_REG_CMx_CPUID_PARTNO_CM0P) {
    // STM32F0 (RM0091, pg914; RM0360, pg713)
    // STM32L0 (RM0377, pg813; RM0367, pg915; RM0376, pg917)
    // STM32G0 (RM0444, pg1367)
    ret = stlink_read_debug32(sl, 0x40015800, chip_id);
    
    if (*chip_id == 0) {
      // these devices don't have a DBG_IDCODE register
      // use PART_NUMBER from JTAG_ID instead
      // STM32WB05 (RM0491, pg115)
      // STM32WB06/WB07 (RM0530, pg105)
      // STM32WB09 (RM0505, pg167)
      // STM32WL3x (RM0511, pg176)
      ret = stlink_read_debug32(sl, STM32WB0_JTAG_ID, chip_id);
      *chip_id = (*chip_id) >> STM32WB0_JTAG_PART_NR;
    }
  } else if(cpu_id.part == STM32_REG_CMx_CPUID_PARTNO_CM33) {
    // STM32L5 (RM0438, pg2157) / STM32U5 (RM0456, pg3085)
    // H5 returns 0 here because DBGMCU is reached through AP1 rather than AP0.
    ret = stlink_read_debug32(sl, 0xE0044000, chip_id);

    if(ret == 0 && stlink_is_cm33_core(sl) &&
       stlink_h5_dbgmcu_probe_looks_like_h5(&cpu_id, *chip_id)) {
      /* Switch the session to AP1-backed H5 access and use the synthetic H5 id. */
      stlink_h5_enable_ap1_mode(sl);
      if(!sl->h5_native_debug_regs) {
        stlink_invalidate_ap_session(sl);
      }
      *chip_id = STM32_CHIPID_H5xx;
      ret = 0;
      goto on_chip_id_read_done;
    }
  } else /* СM3, СM4, CM7 */ {
    // default chipid address

    // STM32F1 (RM0008, pg1087; RM0041, pg681)
    // STM32F2 (RM0033, pg1326)
    // STM32F3 (RM0316, pg1095; RM0313, pg874)
    // STM32F7 (RM0385, pg1676; RM0410, pg1912)
    // STM32L1 (RM0038, pg861)
    // STM32L4 (RM0351, pg1840; RM0394, pg1560)
    // STM32G4 (RM0440, pg2086)
    // STM32WB (RM0434, pg1406)
    ret = stlink_read_debug32(sl, 0xE0042000, chip_id);
  }

  if(ret || !(*chip_id)) {
    *chip_id = 0;
    ret = ret?ret:-1;
    ELOG("Could not find chip id!\n");
  } else {
    *chip_id = (*chip_id) & 0xfff;

    // Fix chip_id for F4 rev A errata, read CPU ID, as CoreID is the same for
    // F2/F4
    if(*chip_id == 0x411 && cpu_id.part == STM32_REG_CMx_CPUID_PARTNO_CM4) {
      *chip_id = 0x413;
    }
  }

on_chip_id_read_done:
  if(*chip_id != STM32_CHIPID_H5xx) {
    stlink_h5_reset_state(sl, original_target_ap);
  }

  return (ret);
}

/**
 * Reads and decodes the flash parameters, as dynamically as possible
 * @param sl
 * @return 0 for success, or -1 for unsupported core type.
 */
int32_t stlink_load_device_params(stlink_t *sl) {
  // This seems to normally work so is unnecessary info for a normal user.
  // Demoted to debug. -- REW
  DLOG("Loading device parameters....\n");
  const struct stlink_chipid_params *params = NULL;
  stlink_core_id(sl);
  uint32_t flash_size;

  if(stlink_chip_id(sl, &sl->chip_id)) {
    return (-1);
  }

  params = stlink_chipid_get_params(sl->chip_id);

  if(params == NULL) {
    WLOG("unknown chip id! %#x\n", sl->chip_id);
    return (-1);
  }

  if(params->flash_type == STM32_FLASH_TYPE_UNKNOWN) {
    WLOG("Invalid flash type, please check device declaration\n");
    sl->flash_size = 0;
    return (0);
  }

  if(sl->target_ap != params->target_ap) {
    sl->target_ap = params->target_ap;
    stlink_invalidate_ap_session(sl);
  } else if(!stlink_h5_uses_ap(sl)) {
    stlink_invalidate_ap_session(sl);
  }
  if(sl->chip_id == STM32_CHIPID_H5xx) {
    stlink_h5_enable_ap1_mode(sl);
  }

  // These are fixed...
  sl->flash_base = STM32_FLASH_BASE;
  sl->sram_base = STM32_SRAM_BASE;
  stlink_read_debug32(sl, (params->flash_size_reg) & ~3, &flash_size);

  if(params->flash_size_reg & 2) {
    flash_size = flash_size >> 16;
  }

  if(params->flash_type != STM32_FLASH_TYPE_WB0) {
    flash_size = flash_size & 0xffff;
  }

  if((sl->chip_id == STM32_CHIPID_L1_MD ||
       sl->chip_id == STM32_CHIPID_F1_VL_MD_LD ||
       sl->chip_id == STM32_CHIPID_L1_MD_PLUS) &&
      (flash_size == 0)) {
    sl->flash_size = 128 * 1024;
  } else if(sl->chip_id == STM32_CHIPID_L1_CAT2) {
    sl->flash_size = (flash_size & 0xff) * 1024;
  } else if((sl->chip_id & 0xFFF) == STM32_CHIPID_L1_MD_PLUS_HD) {
    // 0 is 384k and 1 is 256k
    if(flash_size == 0) {
      sl->flash_size = 384 * 1024;
    } else {
      sl->flash_size = 256 * 1024;
    }
  } else if(params->flash_type == STM32_FLASH_TYPE_WB0) {
    sl->flash_base = STM32WB0_FLASH_BASE;
    sl->flash_size = ((flash_size & 0x1ffff) + 1) * 4;
    if(sl->chip_id == STM32_CHIPID_WL3x) {
      // RM0511, p211
      switch((flash_size >> STM32_FLASH_WB0_RAM_SIZE) & 0x01)
      {
        case 0: sl->sram_size = 16*1024; break;
        case 1: sl->sram_size = 32*1024; break;
      }
    } else if(sl->chip_id != STM32_CHIPID_WB05) {
      // WB06/WB07 RM0530, p149
      // WB09      RM0505, p183
      switch((flash_size >> STM32_FLASH_WB0_RAM_SIZE) & 0x03)
      {
        case 0: // also 32kB
        case 1: sl->sram_size = 32*1024; break;
        case 2: sl->sram_size = 48*1024; break;
        case 3: sl->sram_size = 64*1024; break;
      }
    }
  } else {
    sl->flash_size = flash_size * 1024;
  }

