STM32World/stlink/src/stlink-lib/common_legacy.c
  sl->flash_type = params->flash_type;
  sl->flash_pgsz = params->flash_pagesize;
  sl->sram_size = params->sram_size;
  sl->sys_base = params->bootrom_base;
  sl->sys_size = params->bootrom_size;
  sl->option_base = params->option_base;
  sl->option_size = params->option_size;
  sl->chip_flags = params->flags;
  sl->otp_base = params->otp_base;
  sl->otp_size = params->otp_size;

  // medium and low devices have the same chipid. ram size depends on flash
  // size. STM32F100xx datasheet Doc ID 16455 Table 2
  if(sl->chip_id == STM32_CHIPID_F1_VL_MD_LD && sl->flash_size < 64 * 1024) {
    sl->sram_size = 0x1000;
  }

  if(sl->chip_id == STM32_CHIPID_G4_CAT3) {
    uint32_t flash_optr;
    stlink_read_debug32(sl, STM32_FLASH_Gx_OPTR, &flash_optr);

    if(!(flash_optr & (1 << STM32_FLASH_G4_OPTR_DBANK))) {
      sl->flash_pgsz <<= 1;
    }
  }

  if(sl->chip_id == STM32_CHIPID_L5x2xx) {
    uint32_t flash_optr;
    stlink_read_debug32(sl, STM32_FLASH_L5_OPTR, &flash_optr);

    if(sl->flash_size == 512*1024 && (flash_optr & (1 << 22)) != 0) {
      sl->flash_pgsz = 0x800;
    }
  }
  
  // H7 devices with small flash has one bank
  if(sl->chip_flags & CHIP_F_HAS_DUAL_BANK &&
      sl->flash_type == STM32_FLASH_TYPE_H7) {
    if((sl->flash_size / sl->flash_pgsz) <= 1)
      sl->chip_flags &= ~CHIP_F_HAS_DUAL_BANK;
  }

  ILOG("%s: %u KiB SRAM, %u KiB flash in at least %u %s pages.\n",
      params->dev_type, (sl->sram_size / 1024), (sl->flash_size / 1024),
      (sl->flash_pgsz < 1024) ? sl->flash_pgsz : (sl->flash_pgsz / 1024),
      (sl->flash_pgsz < 1024) ? "byte" : "KiB");

  return (0);
}

int32_t stlink_target_connect(stlink_t *sl, enum connect_type connect) {
  if(connect == CONNECT_UNDER_RESET) {
    if(stlink_h5_try_connect_under_reset(sl) == 0) {
      goto connected;
    } else {
      /*
       * Fall back to the generic under-reset path for non-H5 targets or when
       * the H5-specific attach fails.
       */
      stlink_enter_swd_mode(sl);
      stlink_core_id(sl);

      stlink_jtag_reset(sl, STLINK_DEBUG_APIV2_DRIVE_NRST_LOW);

      // try to halt the core before reset
      // this is useful if the NRST pin is not connected
      sl->backend->force_debug(sl);

      // minimum reset pulse duration of 20 us (RM0008, 8.1.2 Power reset)
      usleep(20);

      stlink_jtag_reset(sl, STLINK_DEBUG_APIV2_DRIVE_NRST_HIGH);

      // try to halt the core after reset
      uint32_t timeout = time_ms() + 10;
      while (time_ms() < timeout) {
        sl->backend->force_debug(sl);
        usleep(100);
      }

      // check NRST connection
      uint32_t dhcsr = 0;
      stlink_read_debug32(sl, STM32_REG_DHCSR, &dhcsr);
      if((dhcsr & STM32_REG_DHCSR_S_RESET_ST) == 0) {
        WLOG("NRST is not connected\n");
      }

      // addition soft reset for halt before the first instruction
      stlink_soft_reset(sl, 1 /* halt on reset */);
    }
  }

connected:
  if(stlink_current_mode(sl) != STLINK_DEV_DEBUG_MODE &&
        stlink_enter_swd_mode(sl)) {
    printf("Failed to enter SWD mode\n");
    return -1;
  }

  if(connect == CONNECT_NORMAL) {
    stlink_reset(sl, RESET_AUTO);
  }

  if(stlink_load_device_params(sl) != 0) {
    return (-1);
  }

  if(sl->chip_id == STM32_CHIPID_H5xx) {
    stlink_h5_mark_attached(sl);
  }

  return (0);
}

// ==================================================

// this function is called in sg_legacy.c
void stlink_run_at(stlink_t *sl, stm32_addr_t addr) {
  stlink_write_reg(sl, addr, 15); /* pc register */
  stlink_run(sl, RUN_NORMAL);

  while (stlink_is_core_halted(sl)) {
    usleep(3000000);
  }
}
